MikroElektronika/core_packages/PIC/XC8/def/PIC18F4580/mcu.h
// Register: PORTD
#define PORTD PORTD
extern volatile unsigned char           PORTD               __at(0xF83);
#ifndef _LIB_BUILD
asm("PORTD equ 0F83h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0                    :1;
        unsigned RD1                    :1;
        unsigned RD2                    :1;
        unsigned RD3                    :1;
        unsigned RD4                    :1;
        unsigned RD5                    :1;
        unsigned RD6                    :1;
        unsigned RD7                    :1;
    };
    struct {
        unsigned PSP0                   :1;
        unsigned PSP1                   :1;
        unsigned PSP2                   :1;
        unsigned PSP3                   :1;
        unsigned PSP4                   :1;
        unsigned PSP5                   :1;
        unsigned PSP6                   :1;
        unsigned PSP7                   :1;
    };
    struct {
        unsigned C1INB                  :1;
        unsigned C1INA                  :1;
        unsigned C2INB                  :1;
        unsigned C2INA                  :1;
        unsigned P1A                    :1;
        unsigned P1B                    :1;
        unsigned P1C                    :1;
        unsigned P1D                    :1;
    };
    struct {
        unsigned                        :4;
        unsigned ECCP1                  :1;
    };
    struct {
        unsigned                        :7;
        unsigned SS2                    :1;
    };
} PORTDbits_t;
extern volatile PORTDbits_t PORTDbits __at(0xF83);
// bitfield macros
#define _PORTD_RD0_POSN                                     0x0
#define _PORTD_RD0_POSITION                                 0x0
#define _PORTD_RD0_SIZE                                     0x1
#define _PORTD_RD0_LENGTH                                   0x1
#define _PORTD_RD0_MASK                                     0x1
#define _PORTD_RD1_POSN                                     0x1
#define _PORTD_RD1_POSITION                                 0x1
#define _PORTD_RD1_SIZE                                     0x1
#define _PORTD_RD1_LENGTH                                   0x1
#define _PORTD_RD1_MASK                                     0x2
#define _PORTD_RD2_POSN                                     0x2
#define _PORTD_RD2_POSITION                                 0x2
#define _PORTD_RD2_SIZE                                     0x1
#define _PORTD_RD2_LENGTH                                   0x1
#define _PORTD_RD2_MASK                                     0x4
#define _PORTD_RD3_POSN                                     0x3
#define _PORTD_RD3_POSITION                                 0x3
#define _PORTD_RD3_SIZE                                     0x1
#define _PORTD_RD3_LENGTH                                   0x1
#define _PORTD_RD3_MASK                                     0x8
#define _PORTD_RD4_POSN                                     0x4
#define _PORTD_RD4_POSITION                                 0x4
#define _PORTD_RD4_SIZE                                     0x1
#define _PORTD_RD4_LENGTH                                   0x1
#define _PORTD_RD4_MASK                                     0x10
#define _PORTD_RD5_POSN                                     0x5
#define _PORTD_RD5_POSITION                                 0x5
#define _PORTD_RD5_SIZE                                     0x1
#define _PORTD_RD5_LENGTH                                   0x1
#define _PORTD_RD5_MASK                                     0x20
#define _PORTD_RD6_POSN                                     0x6
#define _PORTD_RD6_POSITION                                 0x6
#define _PORTD_RD6_SIZE                                     0x1
#define _PORTD_RD6_LENGTH                                   0x1
#define _PORTD_RD6_MASK                                     0x40
#define _PORTD_RD7_POSN                                     0x7
#define _PORTD_RD7_POSITION                                 0x7
#define _PORTD_RD7_SIZE                                     0x1
#define _PORTD_RD7_LENGTH                                   0x1
#define _PORTD_RD7_MASK                                     0x80
#define _PORTD_PSP0_POSN                                    0x0
#define _PORTD_PSP0_POSITION                                0x0
#define _PORTD_PSP0_SIZE                                    0x1
#define _PORTD_PSP0_LENGTH                                  0x1
#define _PORTD_PSP0_MASK                                    0x1
#define _PORTD_PSP1_POSN                                    0x1
#define _PORTD_PSP1_POSITION                                0x1
#define _PORTD_PSP1_SIZE                                    0x1
#define _PORTD_PSP1_LENGTH                                  0x1
#define _PORTD_PSP1_MASK                                    0x2
#define _PORTD_PSP2_POSN                                    0x2
#define _PORTD_PSP2_POSITION                                0x2
#define _PORTD_PSP2_SIZE                                    0x1
#define _PORTD_PSP2_LENGTH                                  0x1
#define _PORTD_PSP2_MASK                                    0x4
#define _PORTD_PSP3_POSN                                    0x3
#define _PORTD_PSP3_POSITION                                0x3
#define _PORTD_PSP3_SIZE                                    0x1
#define _PORTD_PSP3_LENGTH                                  0x1
#define _PORTD_PSP3_MASK                                    0x8
#define _PORTD_PSP4_POSN                                    0x4
#define _PORTD_PSP4_POSITION                                0x4
#define _PORTD_PSP4_SIZE                                    0x1
#define _PORTD_PSP4_LENGTH                                  0x1
#define _PORTD_PSP4_MASK                                    0x10
#define _PORTD_PSP5_POSN                                    0x5
#define _PORTD_PSP5_POSITION                                0x5
#define _PORTD_PSP5_SIZE                                    0x1
#define _PORTD_PSP5_LENGTH                                  0x1
#define _PORTD_PSP5_MASK                                    0x20
#define _PORTD_PSP6_POSN                                    0x6
#define _PORTD_PSP6_POSITION                                0x6
#define _PORTD_PSP6_SIZE                                    0x1
#define _PORTD_PSP6_LENGTH                                  0x1
#define _PORTD_PSP6_MASK                                    0x40
#define _PORTD_PSP7_POSN                                    0x7
#define _PORTD_PSP7_POSITION                                0x7
#define _PORTD_PSP7_SIZE                                    0x1
#define _PORTD_PSP7_LENGTH                                  0x1
#define _PORTD_PSP7_MASK                                    0x80
#define _PORTD_C1INB_POSN                                   0x0
#define _PORTD_C1INB_POSITION                               0x0
#define _PORTD_C1INB_SIZE                                   0x1
#define _PORTD_C1INB_LENGTH                                 0x1
#define _PORTD_C1INB_MASK                                   0x1
#define _PORTD_C1INA_POSN                                   0x1
#define _PORTD_C1INA_POSITION                               0x1
#define _PORTD_C1INA_SIZE                                   0x1
#define _PORTD_C1INA_LENGTH                                 0x1
#define _PORTD_C1INA_MASK                                   0x2
#define _PORTD_C2INB_POSN                                   0x2
#define _PORTD_C2INB_POSITION                               0x2
#define _PORTD_C2INB_SIZE                                   0x1
#define _PORTD_C2INB_LENGTH                                 0x1
#define _PORTD_C2INB_MASK                                   0x4
#define _PORTD_C2INA_POSN                                   0x3
#define _PORTD_C2INA_POSITION                               0x3
#define _PORTD_C2INA_SIZE                                   0x1
#define _PORTD_C2INA_LENGTH                                 0x1
#define _PORTD_C2INA_MASK                                   0x8
#define _PORTD_P1A_POSN                                     0x4
#define _PORTD_P1A_POSITION                                 0x4
#define _PORTD_P1A_SIZE                                     0x1
#define _PORTD_P1A_LENGTH                                   0x1
#define _PORTD_P1A_MASK                                     0x10
#define _PORTD_P1B_POSN                                     0x5
#define _PORTD_P1B_POSITION                                 0x5
#define _PORTD_P1B_SIZE                                     0x1
#define _PORTD_P1B_LENGTH                                   0x1
#define _PORTD_P1B_MASK                                     0x20
#define _PORTD_P1C_POSN                                     0x6
#define _PORTD_P1C_POSITION                                 0x6
#define _PORTD_P1C_SIZE                                     0x1
#define _PORTD_P1C_LENGTH                                   0x1
#define _PORTD_P1C_MASK                                     0x40
#define _PORTD_P1D_POSN                                     0x7
#define _PORTD_P1D_POSITION                                 0x7
#define _PORTD_P1D_SIZE                                     0x1
#define _PORTD_P1D_LENGTH                                   0x1
#define _PORTD_P1D_MASK                                     0x80
#define _PORTD_ECCP1_POSN                                   0x4
#define _PORTD_ECCP1_POSITION                               0x4
#define _PORTD_ECCP1_SIZE                                   0x1
#define _PORTD_ECCP1_LENGTH                                 0x1
#define _PORTD_ECCP1_MASK                                   0x10
#define _PORTD_SS2_POSN                                     0x7
#define _PORTD_SS2_POSITION                                 0x7
#define _PORTD_SS2_SIZE                                     0x1
#define _PORTD_SS2_LENGTH                                   0x1
#define _PORTD_SS2_MASK                                     0x80

// Register: PORTE
#define PORTE PORTE
extern volatile unsigned char           PORTE               __at(0xF84);
#ifndef _LIB_BUILD
asm("PORTE equ 0F84h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0                    :1;
        unsigned RE1                    :1;
        unsigned RE2                    :1;
        unsigned RE3                    :1;
    };
    struct {
        unsigned PD2                    :1;
        unsigned PC2                    :1;
        unsigned CCP10                  :1;
        unsigned CCP9E                  :1;
    };
    struct {
        unsigned RDE                    :1;
        unsigned WRE                    :1;
        unsigned CS                     :1;
        unsigned PC3E                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned PB2                    :1;
    };
} PORTEbits_t;
