MikroElektronika/core_packages/PIC/XC8/def/PIC18F4580/mcu.h
// Register: ECCP1CON
#define ECCP1CON ECCP1CON
extern volatile unsigned char           ECCP1CON            __at(0xFBA);
#ifndef _LIB_BUILD
asm("ECCP1CON equ 0FBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ECCP1M                 :4;
        unsigned EDC1B                  :2;
        unsigned EPWM1M                 :2;
    };
    struct {
        unsigned ECCP1M0                :1;
        unsigned ECCP1M1                :1;
        unsigned ECCP1M2                :1;
        unsigned ECCP1M3                :1;
        unsigned EDC1B0                 :1;
        unsigned EDC1B1                 :1;
        unsigned EPWM1M0                :1;
        unsigned EPWM1M1                :1;
    };
} ECCP1CONbits_t;
extern volatile ECCP1CONbits_t ECCP1CONbits __at(0xFBA);
// bitfield macros
#define _ECCP1CON_ECCP1M_POSN                               0x0
#define _ECCP1CON_ECCP1M_POSITION                           0x0
#define _ECCP1CON_ECCP1M_SIZE                               0x4
#define _ECCP1CON_ECCP1M_LENGTH                             0x4
#define _ECCP1CON_ECCP1M_MASK                               0xF
#define _ECCP1CON_EDC1B_POSN                                0x4
#define _ECCP1CON_EDC1B_POSITION                            0x4
#define _ECCP1CON_EDC1B_SIZE                                0x2
#define _ECCP1CON_EDC1B_LENGTH                              0x2
#define _ECCP1CON_EDC1B_MASK                                0x30
#define _ECCP1CON_EPWM1M_POSN                               0x6
#define _ECCP1CON_EPWM1M_POSITION                           0x6
#define _ECCP1CON_EPWM1M_SIZE                               0x2
#define _ECCP1CON_EPWM1M_LENGTH                             0x2
#define _ECCP1CON_EPWM1M_MASK                               0xC0
#define _ECCP1CON_ECCP1M0_POSN                              0x0
#define _ECCP1CON_ECCP1M0_POSITION                          0x0
#define _ECCP1CON_ECCP1M0_SIZE                              0x1
#define _ECCP1CON_ECCP1M0_LENGTH                            0x1
#define _ECCP1CON_ECCP1M0_MASK                              0x1
#define _ECCP1CON_ECCP1M1_POSN                              0x1
#define _ECCP1CON_ECCP1M1_POSITION                          0x1
#define _ECCP1CON_ECCP1M1_SIZE                              0x1
#define _ECCP1CON_ECCP1M1_LENGTH                            0x1
#define _ECCP1CON_ECCP1M1_MASK                              0x2
#define _ECCP1CON_ECCP1M2_POSN                              0x2
#define _ECCP1CON_ECCP1M2_POSITION                          0x2
#define _ECCP1CON_ECCP1M2_SIZE                              0x1
#define _ECCP1CON_ECCP1M2_LENGTH                            0x1
#define _ECCP1CON_ECCP1M2_MASK                              0x4
#define _ECCP1CON_ECCP1M3_POSN                              0x3
#define _ECCP1CON_ECCP1M3_POSITION                          0x3
#define _ECCP1CON_ECCP1M3_SIZE                              0x1
#define _ECCP1CON_ECCP1M3_LENGTH                            0x1
#define _ECCP1CON_ECCP1M3_MASK                              0x8
#define _ECCP1CON_EDC1B0_POSN                               0x4
#define _ECCP1CON_EDC1B0_POSITION                           0x4
#define _ECCP1CON_EDC1B0_SIZE                               0x1
#define _ECCP1CON_EDC1B0_LENGTH                             0x1
#define _ECCP1CON_EDC1B0_MASK                               0x10
#define _ECCP1CON_EDC1B1_POSN                               0x5
#define _ECCP1CON_EDC1B1_POSITION                           0x5
#define _ECCP1CON_EDC1B1_SIZE                               0x1
#define _ECCP1CON_EDC1B1_LENGTH                             0x1
#define _ECCP1CON_EDC1B1_MASK                               0x20
#define _ECCP1CON_EPWM1M0_POSN                              0x6
#define _ECCP1CON_EPWM1M0_POSITION                          0x6
#define _ECCP1CON_EPWM1M0_SIZE                              0x1
#define _ECCP1CON_EPWM1M0_LENGTH                            0x1
#define _ECCP1CON_EPWM1M0_MASK                              0x40
#define _ECCP1CON_EPWM1M1_POSN                              0x7
#define _ECCP1CON_EPWM1M1_POSITION                          0x7
#define _ECCP1CON_EPWM1M1_SIZE                              0x1
#define _ECCP1CON_EPWM1M1_LENGTH                            0x1
#define _ECCP1CON_EPWM1M1_MASK                              0x80

// Register: ECCPR1
#define ECCPR1 ECCPR1
extern volatile unsigned short          ECCPR1              __at(0xFBB);
#ifndef _LIB_BUILD
asm("ECCPR1 equ 0FBBh");
#endif

// Register: ECCPR1L
#define ECCPR1L ECCPR1L
extern volatile unsigned char           ECCPR1L             __at(0xFBB);
#ifndef _LIB_BUILD
asm("ECCPR1L equ 0FBBh");
#endif

// Register: ECCPR1H
#define ECCPR1H ECCPR1H
extern volatile unsigned char           ECCPR1H             __at(0xFBC);
#ifndef _LIB_BUILD
asm("ECCPR1H equ 0FBCh");
#endif

// Register: CCP1CON
#define CCP1CON CCP1CON
extern volatile unsigned char           CCP1CON             __at(0xFBD);
#ifndef _LIB_BUILD
asm("CCP1CON equ 0FBDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1M                  :4;
        unsigned DC1B                   :2;
    };
    struct {
        unsigned CCP1M0                 :1;
        unsigned CCP1M1                 :1;
        unsigned CCP1M2                 :1;
        unsigned CCP1M3                 :1;
        unsigned DC1B0                  :1;
        unsigned DC1B1                  :1;
    };
} CCP1CONbits_t;
extern volatile CCP1CONbits_t CCP1CONbits __at(0xFBD);
// bitfield macros
#define _CCP1CON_CCP1M_POSN                                 0x0
#define _CCP1CON_CCP1M_POSITION                             0x0
#define _CCP1CON_CCP1M_SIZE                                 0x4
#define _CCP1CON_CCP1M_LENGTH                               0x4
#define _CCP1CON_CCP1M_MASK                                 0xF
#define _CCP1CON_DC1B_POSN                                  0x4
#define _CCP1CON_DC1B_POSITION                              0x4
#define _CCP1CON_DC1B_SIZE                                  0x2
#define _CCP1CON_DC1B_LENGTH                                0x2
#define _CCP1CON_DC1B_MASK                                  0x30
#define _CCP1CON_CCP1M0_POSN                                0x0
#define _CCP1CON_CCP1M0_POSITION                            0x0
#define _CCP1CON_CCP1M0_SIZE                                0x1
#define _CCP1CON_CCP1M0_LENGTH                              0x1
#define _CCP1CON_CCP1M0_MASK                                0x1
#define _CCP1CON_CCP1M1_POSN                                0x1
#define _CCP1CON_CCP1M1_POSITION                            0x1
#define _CCP1CON_CCP1M1_SIZE                                0x1
#define _CCP1CON_CCP1M1_LENGTH                              0x1
#define _CCP1CON_CCP1M1_MASK                                0x2
#define _CCP1CON_CCP1M2_POSN                                0x2
#define _CCP1CON_CCP1M2_POSITION                            0x2
#define _CCP1CON_CCP1M2_SIZE                                0x1
#define _CCP1CON_CCP1M2_LENGTH                              0x1
#define _CCP1CON_CCP1M2_MASK                                0x4
#define _CCP1CON_CCP1M3_POSN                                0x3
#define _CCP1CON_CCP1M3_POSITION                            0x3
#define _CCP1CON_CCP1M3_SIZE                                0x1
#define _CCP1CON_CCP1M3_LENGTH                              0x1
#define _CCP1CON_CCP1M3_MASK                                0x8
#define _CCP1CON_DC1B0_POSN                                 0x4
#define _CCP1CON_DC1B0_POSITION                             0x4
#define _CCP1CON_DC1B0_SIZE                                 0x1
#define _CCP1CON_DC1B0_LENGTH                               0x1
#define _CCP1CON_DC1B0_MASK                                 0x10
#define _CCP1CON_DC1B1_POSN                                 0x5
#define _CCP1CON_DC1B1_POSITION                             0x5
#define _CCP1CON_DC1B1_SIZE                                 0x1
#define _CCP1CON_DC1B1_LENGTH                               0x1
#define _CCP1CON_DC1B1_MASK                                 0x20

// Register: CCPR1
#define CCPR1 CCPR1
extern volatile unsigned short          CCPR1               __at(0xFBE);
#ifndef _LIB_BUILD
asm("CCPR1 equ 0FBEh");
#endif

// Register: CCPR1L
#define CCPR1L CCPR1L
extern volatile unsigned char           CCPR1L              __at(0xFBE);
#ifndef _LIB_BUILD
asm("CCPR1L equ 0FBEh");
#endif

// Register: CCPR1H
#define CCPR1H CCPR1H
extern volatile unsigned char           CCPR1H              __at(0xFBF);
#ifndef _LIB_BUILD
asm("CCPR1H equ 0FBFh");
#endif

// Register: ADCON2
#define ADCON2 ADCON2
extern volatile unsigned char           ADCON2              __at(0xFC0);
#ifndef _LIB_BUILD
asm("ADCON2 equ 0FC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCS                   :3;
        unsigned ACQT                   :3;
        unsigned                        :1;
        unsigned ADFM                   :1;
    };
    struct {
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
        unsigned ACQT0                  :1;
        unsigned ACQT1                  :1;
        unsigned ACQT2                  :1;
    };
} ADCON2bits_t;
