MikroElektronika/core_packages/PIC/XC8/def/PIC18F4580/mcu.h
// Register: PCL
#define PCL PCL
extern volatile unsigned char           PCL                 __at(0xFF9);
#ifndef _LIB_BUILD
asm("PCL equ 0FF9h");
#endif

// Register: PCLATH
#define PCLATH PCLATH
extern volatile unsigned char           PCLATH              __at(0xFFA);
#ifndef _LIB_BUILD
asm("PCLATH equ 0FFAh");
#endif

// Register: PCLATU
#define PCLATU PCLATU
extern volatile unsigned char           PCLATU              __at(0xFFB);
#ifndef _LIB_BUILD
asm("PCLATU equ 0FFBh");
#endif

// Register: STKPTR
#define STKPTR STKPTR
extern volatile unsigned char           STKPTR              __at(0xFFC);
#ifndef _LIB_BUILD
asm("STKPTR equ 0FFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STKPTR                 :5;
        unsigned                        :1;
        unsigned STKUNF                 :1;
        unsigned STKFUL                 :1;
    };
    struct {
        unsigned STKPTR0                :1;
        unsigned STKPTR1                :1;
        unsigned STKPTR2                :1;
        unsigned STKPTR3                :1;
        unsigned STKPTR4                :1;
        unsigned                        :2;
        unsigned STKOVF                 :1;
    };
} STKPTRbits_t;
extern volatile STKPTRbits_t STKPTRbits __at(0xFFC);
// bitfield macros
#define _STKPTR_STKPTR_POSN                                 0x0
#define _STKPTR_STKPTR_POSITION                             0x0
#define _STKPTR_STKPTR_SIZE                                 0x5
#define _STKPTR_STKPTR_LENGTH                               0x5
#define _STKPTR_STKPTR_MASK                                 0x1F
#define _STKPTR_STKUNF_POSN                                 0x6
#define _STKPTR_STKUNF_POSITION                             0x6
#define _STKPTR_STKUNF_SIZE                                 0x1
#define _STKPTR_STKUNF_LENGTH                               0x1
#define _STKPTR_STKUNF_MASK                                 0x40
#define _STKPTR_STKFUL_POSN                                 0x7
#define _STKPTR_STKFUL_POSITION                             0x7
#define _STKPTR_STKFUL_SIZE                                 0x1
#define _STKPTR_STKFUL_LENGTH                               0x1
#define _STKPTR_STKFUL_MASK                                 0x80
#define _STKPTR_STKPTR0_POSN                                0x0
#define _STKPTR_STKPTR0_POSITION                            0x0
#define _STKPTR_STKPTR0_SIZE                                0x1
#define _STKPTR_STKPTR0_LENGTH                              0x1
#define _STKPTR_STKPTR0_MASK                                0x1
#define _STKPTR_STKPTR1_POSN                                0x1
#define _STKPTR_STKPTR1_POSITION                            0x1
#define _STKPTR_STKPTR1_SIZE                                0x1
#define _STKPTR_STKPTR1_LENGTH                              0x1
#define _STKPTR_STKPTR1_MASK                                0x2
#define _STKPTR_STKPTR2_POSN                                0x2
#define _STKPTR_STKPTR2_POSITION                            0x2
#define _STKPTR_STKPTR2_SIZE                                0x1
#define _STKPTR_STKPTR2_LENGTH                              0x1
#define _STKPTR_STKPTR2_MASK                                0x4
#define _STKPTR_STKPTR3_POSN                                0x3
#define _STKPTR_STKPTR3_POSITION                            0x3
#define _STKPTR_STKPTR3_SIZE                                0x1
#define _STKPTR_STKPTR3_LENGTH                              0x1
#define _STKPTR_STKPTR3_MASK                                0x8
#define _STKPTR_STKPTR4_POSN                                0x4
#define _STKPTR_STKPTR4_POSITION                            0x4
#define _STKPTR_STKPTR4_SIZE                                0x1
#define _STKPTR_STKPTR4_LENGTH                              0x1
#define _STKPTR_STKPTR4_MASK                                0x10
#define _STKPTR_STKOVF_POSN                                 0x7
#define _STKPTR_STKOVF_POSITION                             0x7
#define _STKPTR_STKOVF_SIZE                                 0x1
#define _STKPTR_STKOVF_LENGTH                               0x1
#define _STKPTR_STKOVF_MASK                                 0x80

// Register: TOS
#define TOS TOS
#ifndef __CCI__
extern volatile __uint24                TOS                 __at(0xFFD);
#endif
#ifndef _LIB_BUILD
asm("TOS equ 0FFDh");
#endif

// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0xFFD);
#ifndef _LIB_BUILD
asm("TOSL equ 0FFDh");
#endif

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0xFFE);
#ifndef _LIB_BUILD
asm("TOSH equ 0FFEh");
#endif

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0xFFF);
#ifndef _LIB_BUILD
asm("TOSU equ 0FFFh");
#endif

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// BAUDCON<ABDEN>
extern volatile __bit                   ABDEN               __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 ABDEN_bit           _BIT_ACCESS(BAUDCON,0)
// BAUDCON<ABDOVF>
extern volatile __bit                   ABDOVF              __at(0x7DC7);	// @ (0xFB8 * 8 + 7)
#define                                 ABDOVF_bit          _BIT_ACCESS(BAUDCON,7)
// SSPCON2<ACKDT>
extern volatile __bit                   ACKDT               __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ACKDT_bit           _BIT_ACCESS(SSPCON2,5)
// SSPCON2<ACKEN>
extern volatile __bit                   ACKEN               __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ACKEN_bit           _BIT_ACCESS(SSPCON2,4)
// SSPCON2<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0x7E2E);	// @ (0xFC5 * 8 + 6)
#define                                 ACKSTAT_bit         _BIT_ACCESS(SSPCON2,6)
// ADCON2<ACQT0>
extern volatile __bit                   ACQT0               __at(0x7E03);	// @ (0xFC0 * 8 + 3)
#define                                 ACQT0_bit           _BIT_ACCESS(ADCON2,3)
// ADCON2<ACQT1>
extern volatile __bit                   ACQT1               __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 ACQT1_bit           _BIT_ACCESS(ADCON2,4)
// ADCON2<ACQT2>
extern volatile __bit                   ACQT2               __at(0x7E05);	// @ (0xFC0 * 8 + 5)
#define                                 ACQT2_bit           _BIT_ACCESS(ADCON2,5)
// ADCON2<ADCS0>
extern volatile __bit                   ADCS0               __at(0x7E00);	// @ (0xFC0 * 8 + 0)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON2,0)
// ADCON2<ADCS1>
extern volatile __bit                   ADCS1               __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON2,1)
// ADCON2<ADCS2>
extern volatile __bit                   ADCS2               __at(0x7E02);	// @ (0xFC0 * 8 + 2)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON2,2)
// RCSTA<ADDEN>
extern volatile __bit                   ADDEN               __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADDEN_bit           _BIT_ACCESS(RCSTA,3)
// RCSTA<ADEN>
extern volatile __bit                   ADEN                __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADEN_bit            _BIT_ACCESS(RCSTA,3)
// ADCON2<ADFM>
extern volatile __bit                   ADFM                __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON2,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// IPR1<ADIP>
extern volatile __bit                   ADIP                __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 ADIP_bit            _BIT_ACCESS(IPR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// PORTA<AN0>
extern volatile __bit                   AN0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 AN0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<AN1>
extern volatile __bit                   AN1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 AN1_bit             _BIT_ACCESS(PORTA,1)
// PORTB<AN10>
extern volatile __bit                   AN10                __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 AN10_bit            _BIT_ACCESS(PORTB,0)
// PORTA<AN2>
extern volatile __bit                   AN2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 AN2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<AN3>
extern volatile __bit                   AN3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 AN3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<AN4>
extern volatile __bit                   AN4                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 AN4_bit             _BIT_ACCESS(PORTA,5)
// PORTB<AN8>
extern volatile __bit                   AN8                 __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 AN8_bit             _BIT_ACCESS(PORTB,1)
// PORTB<AN9>
extern volatile __bit                   AN9                 __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 AN9_bit             _BIT_ACCESS(PORTB,4)
// B0D0<B0D00>
extern volatile __bit                   B0D00               __at(0x7130);	// @ (0xE26 * 8 + 0)
#define                                 B0D00_bit           _BIT_ACCESS(B0D0,0)
// B0D0<B0D01>
extern volatile __bit                   B0D01               __at(0x7131);	// @ (0xE26 * 8 + 1)
#define                                 B0D01_bit           _BIT_ACCESS(B0D0,1)
// B0D0<B0D02>
extern volatile __bit                   B0D02               __at(0x7132);	// @ (0xE26 * 8 + 2)
#define                                 B0D02_bit           _BIT_ACCESS(B0D0,2)
// B0D0<B0D03>
extern volatile __bit                   B0D03               __at(0x7133);	// @ (0xE26 * 8 + 3)
#define                                 B0D03_bit           _BIT_ACCESS(B0D0,3)
// B0D0<B0D04>
extern volatile __bit                   B0D04               __at(0x7134);	// @ (0xE26 * 8 + 4)
#define                                 B0D04_bit           _BIT_ACCESS(B0D0,4)
// B0D0<B0D05>
extern volatile __bit                   B0D05               __at(0x7135);	// @ (0xE26 * 8 + 5)
#define                                 B0D05_bit           _BIT_ACCESS(B0D0,5)
// B0D0<B0D06>
extern volatile __bit                   B0D06               __at(0x7136);	// @ (0xE26 * 8 + 6)
#define                                 B0D06_bit           _BIT_ACCESS(B0D0,6)
// B0D0<B0D07>
extern volatile __bit                   B0D07               __at(0x7137);	// @ (0xE26 * 8 + 7)
#define                                 B0D07_bit           _BIT_ACCESS(B0D0,7)
// B0D1<B0D10>
extern volatile __bit                   B0D10               __at(0x7138);	// @ (0xE27 * 8 + 0)
#define                                 B0D10_bit           _BIT_ACCESS(B0D1,0)
// B0D1<B0D11>
extern volatile __bit                   B0D11               __at(0x7139);	// @ (0xE27 * 8 + 1)
#define                                 B0D11_bit           _BIT_ACCESS(B0D1,1)
// B0D1<B0D12>
extern volatile __bit                   B0D12               __at(0x713A);	// @ (0xE27 * 8 + 2)
#define                                 B0D12_bit           _BIT_ACCESS(B0D1,2)
// B0D1<B0D13>
extern volatile __bit                   B0D13               __at(0x713B);	// @ (0xE27 * 8 + 3)
#define                                 B0D13_bit           _BIT_ACCESS(B0D1,3)
// B0D1<B0D14>
extern volatile __bit                   B0D14               __at(0x713C);	// @ (0xE27 * 8 + 4)
#define                                 B0D14_bit           _BIT_ACCESS(B0D1,4)
// B0D1<B0D15>
extern volatile __bit                   B0D15               __at(0x713D);	// @ (0xE27 * 8 + 5)
#define                                 B0D15_bit           _BIT_ACCESS(B0D1,5)
// B0D1<B0D16>
extern volatile __bit                   B0D16               __at(0x713E);	// @ (0xE27 * 8 + 6)
#define                                 B0D16_bit           _BIT_ACCESS(B0D1,6)
// B0D1<B0D17>
extern volatile __bit                   B0D17               __at(0x713F);	// @ (0xE27 * 8 + 7)
#define                                 B0D17_bit           _BIT_ACCESS(B0D1,7)
// B0D2<B0D20>
extern volatile __bit                   B0D20               __at(0x7140);	// @ (0xE28 * 8 + 0)
#define                                 B0D20_bit           _BIT_ACCESS(B0D2,0)
// B0D2<B0D21>
extern volatile __bit                   B0D21               __at(0x7141);	// @ (0xE28 * 8 + 1)
#define                                 B0D21_bit           _BIT_ACCESS(B0D2,1)
// B0D2<B0D22>
extern volatile __bit                   B0D22               __at(0x7142);	// @ (0xE28 * 8 + 2)
#define                                 B0D22_bit           _BIT_ACCESS(B0D2,2)
// B0D2<B0D23>
extern volatile __bit                   B0D23               __at(0x7143);	// @ (0xE28 * 8 + 3)
#define                                 B0D23_bit           _BIT_ACCESS(B0D2,3)
// B0D2<B0D24>
extern volatile __bit                   B0D24               __at(0x7144);	// @ (0xE28 * 8 + 4)
#define                                 B0D24_bit           _BIT_ACCESS(B0D2,4)
// B0D2<B0D25>
extern volatile __bit                   B0D25               __at(0x7145);	// @ (0xE28 * 8 + 5)
#define                                 B0D25_bit           _BIT_ACCESS(B0D2,5)
// B0D2<B0D26>
extern volatile __bit                   B0D26               __at(0x7146);	// @ (0xE28 * 8 + 6)
#define                                 B0D26_bit           _BIT_ACCESS(B0D2,6)
// B0D2<B0D27>
extern volatile __bit                   B0D27               __at(0x7147);	// @ (0xE28 * 8 + 7)
#define                                 B0D27_bit           _BIT_ACCESS(B0D2,7)
// B0D3<B0D30>
extern volatile __bit                   B0D30               __at(0x7148);	// @ (0xE29 * 8 + 0)
#define                                 B0D30_bit           _BIT_ACCESS(B0D3,0)
// B0D3<B0D31>
extern volatile __bit                   B0D31               __at(0x7149);	// @ (0xE29 * 8 + 1)
#define                                 B0D31_bit           _BIT_ACCESS(B0D3,1)
// B0D3<B0D32>
extern volatile __bit                   B0D32               __at(0x714A);	// @ (0xE29 * 8 + 2)
#define                                 B0D32_bit           _BIT_ACCESS(B0D3,2)
// B0D3<B0D33>
extern volatile __bit                   B0D33               __at(0x714B);	// @ (0xE29 * 8 + 3)
#define                                 B0D33_bit           _BIT_ACCESS(B0D3,3)
// B0D3<B0D34>
extern volatile __bit                   B0D34               __at(0x714C);	// @ (0xE29 * 8 + 4)
#define                                 B0D34_bit           _BIT_ACCESS(B0D3,4)
// B0D3<B0D35>
extern volatile __bit                   B0D35               __at(0x714D);	// @ (0xE29 * 8 + 5)
#define                                 B0D35_bit           _BIT_ACCESS(B0D3,5)
// B0D3<B0D36>
extern volatile __bit                   B0D36               __at(0x714E);	// @ (0xE29 * 8 + 6)
#define                                 B0D36_bit           _BIT_ACCESS(B0D3,6)
// B0D3<B0D37>
extern volatile __bit                   B0D37               __at(0x714F);	// @ (0xE29 * 8 + 7)
#define                                 B0D37_bit           _BIT_ACCESS(B0D3,7)
// B0D4<B0D40>
extern volatile __bit                   B0D40               __at(0x7150);	// @ (0xE2A * 8 + 0)
#define                                 B0D40_bit           _BIT_ACCESS(B0D4,0)
// B0D4<B0D41>
extern volatile __bit                   B0D41               __at(0x7151);	// @ (0xE2A * 8 + 1)
#define                                 B0D41_bit           _BIT_ACCESS(B0D4,1)
// B0D4<B0D42>
extern volatile __bit                   B0D42               __at(0x7152);	// @ (0xE2A * 8 + 2)
#define                                 B0D42_bit           _BIT_ACCESS(B0D4,2)
// B0D4<B0D43>
extern volatile __bit                   B0D43               __at(0x7153);	// @ (0xE2A * 8 + 3)
#define                                 B0D43_bit           _BIT_ACCESS(B0D4,3)
// B0D4<B0D44>
extern volatile __bit                   B0D44               __at(0x7154);	// @ (0xE2A * 8 + 4)
#define                                 B0D44_bit           _BIT_ACCESS(B0D4,4)
// B0D4<B0D45>
extern volatile __bit                   B0D45               __at(0x7155);	// @ (0xE2A * 8 + 5)
#define                                 B0D45_bit           _BIT_ACCESS(B0D4,5)
// B0D4<B0D46>
extern volatile __bit                   B0D46               __at(0x7156);	// @ (0xE2A * 8 + 6)
#define                                 B0D46_bit           _BIT_ACCESS(B0D4,6)
// B0D4<B0D47>
extern volatile __bit                   B0D47               __at(0x7157);	// @ (0xE2A * 8 + 7)
#define                                 B0D47_bit           _BIT_ACCESS(B0D4,7)
// B0D5<B0D50>
extern volatile __bit                   B0D50               __at(0x7158);	// @ (0xE2B * 8 + 0)
#define                                 B0D50_bit           _BIT_ACCESS(B0D5,0)
// B0D5<B0D51>
extern volatile __bit                   B0D51               __at(0x7159);	// @ (0xE2B * 8 + 1)
#define                                 B0D51_bit           _BIT_ACCESS(B0D5,1)
// B0D5<B0D52>
extern volatile __bit                   B0D52               __at(0x715A);	// @ (0xE2B * 8 + 2)
#define                                 B0D52_bit           _BIT_ACCESS(B0D5,2)
// B0D5<B0D53>
extern volatile __bit                   B0D53               __at(0x715B);	// @ (0xE2B * 8 + 3)
#define                                 B0D53_bit           _BIT_ACCESS(B0D5,3)
// B0D5<B0D54>
extern volatile __bit                   B0D54               __at(0x715C);	// @ (0xE2B * 8 + 4)
#define                                 B0D54_bit           _BIT_ACCESS(B0D5,4)
// B0D5<B0D55>
extern volatile __bit                   B0D55               __at(0x715D);	// @ (0xE2B * 8 + 5)
#define                                 B0D55_bit           _BIT_ACCESS(B0D5,5)
// B0D5<B0D56>
extern volatile __bit                   B0D56               __at(0x715E);	// @ (0xE2B * 8 + 6)
#define                                 B0D56_bit           _BIT_ACCESS(B0D5,6)
// B0D5<B0D57>
extern volatile __bit                   B0D57               __at(0x715F);	// @ (0xE2B * 8 + 7)
#define                                 B0D57_bit           _BIT_ACCESS(B0D5,7)
// B0D6<B0D60>
extern volatile __bit                   B0D60               __at(0x7160);	// @ (0xE2C * 8 + 0)
#define                                 B0D60_bit           _BIT_ACCESS(B0D6,0)
// B0D6<B0D61>
extern volatile __bit                   B0D61               __at(0x7161);	// @ (0xE2C * 8 + 1)
#define                                 B0D61_bit           _BIT_ACCESS(B0D6,1)
// B0D6<B0D62>
extern volatile __bit                   B0D62               __at(0x7162);	// @ (0xE2C * 8 + 2)
#define                                 B0D62_bit           _BIT_ACCESS(B0D6,2)
// B0D6<B0D63>
extern volatile __bit                   B0D63               __at(0x7163);	// @ (0xE2C * 8 + 3)
#define                                 B0D63_bit           _BIT_ACCESS(B0D6,3)
// B0D6<B0D64>
extern volatile __bit                   B0D64               __at(0x7164);	// @ (0xE2C * 8 + 4)
#define                                 B0D64_bit           _BIT_ACCESS(B0D6,4)
// B0D6<B0D65>
extern volatile __bit                   B0D65               __at(0x7165);	// @ (0xE2C * 8 + 5)
#define                                 B0D65_bit           _BIT_ACCESS(B0D6,5)
// B0D6<B0D66>
extern volatile __bit                   B0D66               __at(0x7166);	// @ (0xE2C * 8 + 6)
#define                                 B0D66_bit           _BIT_ACCESS(B0D6,6)
// B0D6<B0D67>
extern volatile __bit                   B0D67               __at(0x7167);	// @ (0xE2C * 8 + 7)
#define                                 B0D67_bit           _BIT_ACCESS(B0D6,7)
// B0D7<B0D70>
extern volatile __bit                   B0D70               __at(0x7168);	// @ (0xE2D * 8 + 0)
#define                                 B0D70_bit           _BIT_ACCESS(B0D7,0)
// B0D7<B0D71>
extern volatile __bit                   B0D71               __at(0x7169);	// @ (0xE2D * 8 + 1)
#define                                 B0D71_bit           _BIT_ACCESS(B0D7,1)
// B0D7<B0D72>
extern volatile __bit                   B0D72               __at(0x716A);	// @ (0xE2D * 8 + 2)
#define                                 B0D72_bit           _BIT_ACCESS(B0D7,2)
// B0D7<B0D73>
extern volatile __bit                   B0D73               __at(0x716B);	// @ (0xE2D * 8 + 3)
#define                                 B0D73_bit           _BIT_ACCESS(B0D7,3)
// B0D7<B0D74>
extern volatile __bit                   B0D74               __at(0x716C);	// @ (0xE2D * 8 + 4)
#define                                 B0D74_bit           _BIT_ACCESS(B0D7,4)
// B0D7<B0D75>
extern volatile __bit                   B0D75               __at(0x716D);	// @ (0xE2D * 8 + 5)
#define                                 B0D75_bit           _BIT_ACCESS(B0D7,5)
// B0D7<B0D76>
extern volatile __bit                   B0D76               __at(0x716E);	// @ (0xE2D * 8 + 6)
#define                                 B0D76_bit           _BIT_ACCESS(B0D7,6)
// B0D7<B0D77>
extern volatile __bit                   B0D77               __at(0x716F);	// @ (0xE2D * 8 + 7)
#define                                 B0D77_bit           _BIT_ACCESS(B0D7,7)
// B0DLC<B0DLC0>
extern volatile __bit                   B0DLC0              __at(0x7128);	// @ (0xE25 * 8 + 0)
#define                                 B0DLC0_bit          _BIT_ACCESS(B0DLC,0)
// B0DLC<B0DLC1>
extern volatile __bit                   B0DLC1              __at(0x7129);	// @ (0xE25 * 8 + 1)
#define                                 B0DLC1_bit          _BIT_ACCESS(B0DLC,1)
// B0DLC<B0DLC2>
extern volatile __bit                   B0DLC2              __at(0x712A);	// @ (0xE25 * 8 + 2)
#define                                 B0DLC2_bit          _BIT_ACCESS(B0DLC,2)
// B0DLC<B0DLC3>
extern volatile __bit                   B0DLC3              __at(0x712B);	// @ (0xE25 * 8 + 3)
#define                                 B0DLC3_bit          _BIT_ACCESS(B0DLC,3)
// B0EIDL<B0EID0>
extern volatile __bit                   B0EID0              __at(0x7120);	// @ (0xE24 * 8 + 0)
#define                                 B0EID0_bit          _BIT_ACCESS(B0EIDL,0)
// B0EIDL<B0EID1>
extern volatile __bit                   B0EID1              __at(0x7121);	// @ (0xE24 * 8 + 1)
#define                                 B0EID1_bit          _BIT_ACCESS(B0EIDL,1)
// B0EIDH<B0EID10>
extern volatile __bit                   B0EID10             __at(0x711A);	// @ (0xE23 * 8 + 2)
#define                                 B0EID10_bit         _BIT_ACCESS(B0EIDH,2)
// B0EIDH<B0EID11>
extern volatile __bit                   B0EID11             __at(0x711B);	// @ (0xE23 * 8 + 3)
#define                                 B0EID11_bit         _BIT_ACCESS(B0EIDH,3)
// B0EIDH<B0EID12>
extern volatile __bit                   B0EID12             __at(0x711C);	// @ (0xE23 * 8 + 4)
